{
	"officers":[
		{
			"title": "President",
			"email": "Ethyn.Bazzeghin@colostate.edu",
			"name": "Ethyn Bazzeghin",
			"pronouns": "He/Him",
			"picture": "EthynCSUPic.jpg",
			"bio": "Ethyn Bazzeghin is in his second year at CSU pursuing a major in trumpet performance. This will be Ethyn’s first year as president of the trumpet guild. Ethyn has been pursuing trumpet since 6th grade and has been apart of multiple ensembles at CSU including Symphonic Band, Jazz 2, A Brass Quintet, Baroque Trumpet Ensemble, Trumpet Quartet, Marching Band and Pep Band. Ethyn is striving to become a part of a military band or major orchestra.  In his off time he likes to  play Pickleball, Wiffleball, Minecraft, watch movies, play games, hang out with friends and to make music with others."

		},
		{
			"title": "Vice President",
			"email": "kris15@colostate.edu",
			"name": "Kris Usrey",
			"pronouns": "He/Him",
			"picture": "kris_usrey.jpg",
			"bio": "Kris Usrey is currently in his 5th year at Colorado State University pursuing a double major in trumpet performance and psychology. This is his second year serving as vice president for the university’s ITG chapter. During his time at CSU, he has worked on the creation and editing of all state instructional videos, performed multiple solos in front of the school of music, performed at the ITG conference in Anaheim, California, and even directed a documentary revolving around the CSU trumpet studio. In his free time, you’ll find Kris playing Minecraft, creating YouTube videos, and watching the Denver Broncos. "

		},
		{
			"title": "Treasurer",
			"email": "alexgreg@colostate.edu",
			"name": "Alex Gregory",
			"pronouns": "They/Them",
			"picture": "Alex.CSU.Jpeg",
			"bio": "Alex Gregory is a second year B.M. Music Education student and trumpet player at CSU. They have played in large and chamber ensembles at CSU, as well as in the CSU marching band and the Blue Knights Drum & Bugle Corps. As treasurer, their goal is to create opportunities for musicians by organizing and allocating the chapter's resources. Alex hopes to help continue growing the reputation of the CSU trumpet studio, from a local to an international level."
		},
		{
			"title": "Secratary",
			"email": "alexa.hudson@colostate.edu",
			"name": "Alexa Hudson",
			"pronouns": "She/They",
			"picture": "Alexa.csu.jpeg",
			"bio": "Alexa Hudson is a 5th year student at Colorado State University studying liberal arts and music B.A. , but they hope to be an environmental educator after graduation! She is hopes to make a difference in the trumpet community here during their last year at CSU. She enjoys playing trumpet in the CSU marching band and enjoys playing contemporary, new pieces. Outside of trumpet, they enjoy drawing, sewing, watching cartoons and movies, as well as doing programs about the native species of Colorado with volunteer organizations."
		},
		{
			"title": "Faculty Advisor",
			"email": "shcurtis@colostate.edu",
			"name": "Dr. Stanley Curtis",
			"pronouns": "He/Him",
			"picture": "stanley_curtis.jpg",
			"bio": "Stanley Curtis has developed a career as a trumpeter, teacher, composer and early-music performer. After studying at the University of Alabama, the Cleveland Institute of Music and in the Netherlands on a Fulbright Scholarship, he received his Doctor of Music from Indiana University in 2005. In 1996, he won third prize in the ITG Altenburg International Baroque Trumpet Competition. He has taught at George Mason University and served as Historic Trumpet Division chair of the National Trumpet Competition. Having retired from a 20-year career in the U.S. Navy Band in Washington, D.C., he was appointed trumpet professor at Colorado State University in 2018. In 2022 he became President of the Historic Brass Society. Stanley blogs on his own Trumpet Journey website."
		}
	]
}
