{
	"officers":[
		{
			"title": "President",
			"email": "enzob@colostate.edu",
			"name": "Enzo Barrett",
			"pronouns": "He/Him",
			"picture": "enzo_barrett_hd.JPG",
			"bio": "Enzo is in his last year at CSU persuing a major in music performance, and a minor in computer science. This is Enzo's second year as president of the trumpet guild. Some of his achievements during his time at CSU include being a two time treasuer, president, and current vice president of CSU's Hashdump Security Club, recieving the Chair of the Music Department Award for Excellence in Music Performance, and completing a research project on Charles Ives's 'Variations on America.' In his free time Enzo enjoys practicing lots of trumpet, coding websites, biking, and woodworking."

		},
		{
			"title": "Treasurer",
			"email": "alexgreg@colostate.edu",
			"name": "Alex Gregory",
			"pronouns": "They/Them",
			"picture": "alex_gregory.jpg",
			"bio": "Alex Gregory is a first-year music education student and trumpet player at Colorado State University, and this is their first term as an officer of the CSU International Trumpet Guild chapter. A Denver native, they served as the Greater Boulder Youth Orchestra Principal trumpet from 2020 to 2023. They have played hundreds of performances in many different ensembles, including full baroque orchestra, jazz combinations, wind ensembles, and original compositional premieres. In addition to college, Alex spends their summers competing in Drum Corps International. Most recently, they were recognized as a Rookie of the Year for their trumpet performance contract in the 2023 Blue Knights Drum & Bugle Corps hornline.",
		},
		{
			"title": "Secratary",
			"email": "livcask@colostate.edu",
			"name": "Liv Caskey",
			"pronouns": "She/Her",
			"picture": "liv_caskey.jpg",
			"bio": "Liv Caskey is a sophomore at Colorado State University studying trumpet performance. Liv has been studying trumpet since fifth grade and was a part of jazz, pep band, concert, and marching band, then drum major. In high school, Liv was an avide jazz lover and is now a member of Jazz 1 Big Band and a jazz combo at CSU. She is also a part of symphonic band, concert orchestra for cello, and chamber choir. Liv hopes to be a part of a traveling symphony or jazz house band one day. Outside of playing the trumpet, Liv likes to climb, ski, and read."
		},
		{
			"title": "Faculty Advisor",
			"email": "shcurtis@colostate.edu",
			"name": "Dr. Stanley Curtis",
			"pronouns": "He/Him",
			"picture": "stanley_curtis.jpg",
			"bio": "Stanley Curtis has developed a career as a trumpeter, teacher, composer and early-music performer. After studying at the University of Alabama, the Cleveland Institute of Music and in the Netherlands on a Fulbright Scholarship, he received his Doctor of Music from Indiana University in 2005. In 1996, he won third prize in the ITG Altenburg International Baroque Trumpet Competition. He has taught at George Mason University and served as Historic Trumpet Division chair of the National Trumpet Competition. Having retired from a 20-year career in the U.S. Navy Band in Washington, D.C., he was appointed trumpet professor at Colorado State University in 2018. In 2022 he became President of the Historic Brass Society. Stanley blogs on his own Trumpet Journey website."
		}
	]
}
